In [1]:
import pandas as pd

Importing data via an URL

In [2]:
import requests as request
from io import StringIO 
# I think this above import is used to convert the data in the string format 

url = "https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv"
headers =  {"User-Agent": "Mozilla/5.0 (Macintosh; Intel Mac OS X 10.14; rv:66.0) Gecko/20100101 Firefox/66.0"}
# The above two lines are mostly copied , but a good web dev must know the working behind the scenes.

req = request.get(url = url , headers = headers )

# Converting the data found to String 
data = StringIO(req.text)

In [3]:
pd.read_csv(data)

       Country         Region
0      Algeria         AFRICA
1       Angola         AFRICA
2        Benin         AFRICA
3     Botswana         AFRICA
4      Burkina         AFRICA
..         ...            ...
189   Paraguay  SOUTH AMERICA
190       Peru  SOUTH AMERICA
191   Suriname  SOUTH AMERICA
192    Uruguay  SOUTH AMERICA
193  Venezuela  SOUTH AMERICA

[194 rows x 2 columns]

Handling tsv or formats with different values used for seperation

In [4]:
# I was having path issues so i used absolute path here .
pd.read_csv("C:\\Users\\hp\\Desktop\\ML\\movie_titles_metadata.tsv" , sep = '\t' , names = ['s_no','name','release_year','rating','votes','genre'])

,s_no,name,release_year,rating,votes,genre
0,m0,10 things i hate about you,1999,6.9,62847.0,['comedy' 'romance']
1,m1,1492: conquest of paradise,1992,6.2,10421.0,['adventure' 'biography' 'drama' 'history']
2,m2,15 minutes,2001,6.1,25854.0,['action' 'crime' 'drama' 'thriller']
3,m3,2001: a space odyssey,1968,8.4,163227.0,['adventure' 'mystery' 'sci-fi']
4,m4,48 hrs.,1982,6.9,22289.0,['action' 'comedy' 'crime' 'drama' 'thriller']
...,...,...,...,...,...,...
612,m612,watchmen,2009,7.8,135229.0,['action' 'crime' 'fantasy' 'mystery' 'sci-fi'...
613,m613,xxx,2002,5.6,53505.0,['action' 'adventure' 'crime']
614,m614,x-men,2000,7.4,122149.0,['action' 'sci-fi']
615,m615,young frankenstein,1974,8.0,57618.0,['comedy' 'sci-fi']
616,m616,zulu dawn,1979,6.4,1911.0,['action' 'adventure' 'drama' 'history' 'war']

Making the existing columns as default id columns for the dataframe

In [5]:
pd.read_csv("aug_train.csv")

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1.0
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0.0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0.0

In [6]:
pd.read_csv("aug_train.csv",index_col = "enrollee_id")

,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
enrollee_id,,,,,,,,,,,,,
8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0
31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1.0
24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0
5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0.0
23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0.0

Header parameter used when the data is having the column header as data .

In [9]:
pd.read_csv("test.csv")

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14
0,0,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
1,1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0
2,2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0
3,3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1
4,4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0

In [10]:
# The header = 1 says that the data must be starting from row 1 and the first row is to be treated as column header.
pd.read_csv("test.csv",header=1)

,0,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0
1,2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0
2,3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1
3,4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0

Now if we need to select some specific columns only from a known dataset then it can be explicitly specified while importing

In [15]:
pd.read_csv("aug_train.csv")

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1.0
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0.0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0.0

In [16]:
pd.read_csv("aug_train.csv" , usecols = ["enrollee_id","city","gender"])

       enrollee_id      city gender
0             8949  city_103   Male
1            29725   city_40   Male
2            11561   city_21    NaN
3            33241  city_115    NaN
4              666  city_162   Male
...            ...       ...    ...
19153         7386  city_173   Male
19154        31398  city_103   Male
19155        24576  city_103   Male
19156         5756   city_65   Male
19157        23834   city_67    NaN

[19158 rows x 3 columns]

Now if we need to explicilty set a limit to the rows then we can set the limit .

In [ ]:
pd.read_csv("aug_train.csv")

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,12081,city_65,0.802,Male,Has relevent experience,Full time course,Graduate,STEM,9,50-99,Pvt Ltd,1,33,0.0
96,7364,city_160,0.920,NaN,No relevent experience,Full time course,High School,NaN,2,100-500,Pvt Ltd,1,142,0.0
97,11184,city_74,0.579,NaN,No relevent experience,Full time course,Graduate,STEM,2,100-500,Pvt Ltd,1,34,0.0
98,7016,city_65,0.802,Male,Has relevent experience,no_enrollment,Graduate,STEM,6,50-99,Pvt Ltd,2,14,1.0
99,8695,city_11,0.550,Male,Has relevent experience,no_enrollment,Graduate,STEM,6,10/49,Pvt Ltd,2,27,1.0

In [18]:
pd.read_csv("aug_train.csv",nrows=100)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,12081,city_65,0.802,Male,Has relevent experience,Full time course,Graduate,STEM,9,50-99,Pvt Ltd,1,33,0.0
96,7364,city_160,0.920,NaN,No relevent experience,Full time course,High School,NaN,2,100-500,Pvt Ltd,1,142,0.0
97,11184,city_74,0.579,NaN,No relevent experience,Full time course,Graduate,STEM,2,100-500,Pvt Ltd,1,34,0.0
98,7016,city_65,0.802,Male,Has relevent experience,no_enrollment,Graduate,STEM,6,50-99,Pvt Ltd,2,14,1.0
99,8695,city_11,0.550,Male,Has relevent experience,no_enrollment,Graduate,STEM,6,10/49,Pvt Ltd,2,27,1.0

Now we can also use the chunksize method in pandas to fetch bigdata in chunks of required size when we are dealing with huge .mount of data .

In [31]:
df = pd.read_csv("aug_train.csv" , chunksize = 1000)

In [32]:
for chunk in df :
    print(type(chunk))
    print(chunk)
    print(chunk.shape)

<class 'pandas.core.frame.DataFrame'>
     enrollee_id      city  city_development_index  gender  \
0           8949  city_103                   0.920    Male
1          29725   city_40                   0.776    Male
2          11561   city_21                   0.624     NaN
3          33241  city_115                   0.789     NaN
4            666  city_162                   0.767    Male
..           ...       ...                     ...     ...
995        28500   city_21                   0.624     NaN
996        10371  city_103                   0.920  Female
997        10028   city_73                   0.754    Male
998        29671   city_40                   0.776    Male
999         4482  city_103                   0.920    Male

         relevent_experience enrolled_university education_level  \
0    Has relevent experience       no_enrollment        Graduate
1     No relevent experience       no_enrollment        Graduate
2     No relevent experience    Full time course        Graduate
3     No relevent experience                 NaN        Graduate
4    Has relevent experience       no_enrollment         Masters
..                       ...                 ...             ...
995  Has relevent experience    Full time course        Graduate
996   No relevent experience       no_enrollment             Phd
997  Has relevent experience       no_enrollment        Graduate
998   No relevent experience    Full time course        Graduate
999  Has relevent experience       no_enrollment        Graduate

    major_discipline experience company_size    company_type last_new_job  \
0               STEM        >20          NaN             NaN            1
1               STEM         15        50-99         Pvt Ltd           >4
2               STEM          5          NaN             NaN        never
3    Business Degree         <1          NaN         Pvt Ltd        never
4               STEM        >20        50-99  Funded Startup            4
..               ...        ...          ...             ...          ...
995             STEM         <1      500-999         Pvt Ltd            1
996             STEM          7      500-999   Public Sector            4
997             STEM         15    1000-4999         Pvt Ltd            1
998             STEM          9          NaN             NaN            1
999             STEM        >20        10/49  Funded Startup            1

     training_hours  target
0                36     1.0
1                47     0.0
2                83     0.0
3                52     1.0
4                 8     0.0
..              ...     ...
995              22     0.0
996              28     0.0
997              42     0.0
998              50     0.0
999             105     0.0

[1000 rows x 14 columns]
(1000, 14)
<class 'pandas.core.frame.DataFrame'>
      enrollee_id      city  city_development_index gender  \
1000        23392   city_21                   0.624   Male
1001         5879  city_116                   0.743   Male
1002         8861  city_160                   0.920    NaN
1003        21196   city_75                   0.939   Male
1004        10724   city_21                   0.624    NaN
...           ...       ...                     ...    ...
1995         3479  city_103                   0.920    NaN
1996         9099   city_21                   0.624   Male
1997        15756  city_104                   0.924    NaN
1998        29971   city_28                   0.939   Male
1999         3702  city_103                   0.920   Male

          relevent_experience enrolled_university education_level  \
1000  Has relevent experience       no_enrollment         Masters
1001  Has relevent experience       no_enrollment        Graduate
1002   No relevent experience       no_enrollment         Masters
1003  Has relevent experience       no_enrollment        Graduate
1004  Has relevent experience       no_enrollment        Graduate
...                       ...                 ...             ...
1995   No relevent experience    Full time course        Graduate
1996   No relevent experience    Part time course        Graduate
1997   No relevent experience    Full time course     High School
1998   No relevent experience       no_enrollment        Graduate
1999  Has relevent experience       no_enrollment     High School

     major_discipline experience company_size         company_type  \
1000             STEM          8      100-500              Pvt Ltd
1001             STEM         13      100-500              Pvt Ltd
1002       Humanities          2          <10  Early Stage Startup
1003             STEM          4       10000+              Pvt Ltd
1004             STEM         11       10000+              Pvt Ltd
...               ...        ...          ...                  ...
1995             STEM          4          NaN        Public Sector
1996             STEM          2          NaN                  NaN
1997              NaN          2        10/49  Early Stage Startup
1998             STEM          4    1000-4999        Public Sector
1999              NaN          6        10/49              Pvt Ltd

     last_new_job  training_hours  target
1000        never             162     1.0
1001            4               6     0.0
1002            1              43     0.0
1003            2              41     0.0
1004            1              40     0.0
...           ...             ...     ...
1995            1              15     0.0
1996        never              77     1.0
1997            1              74     0.0
1998            1              14     1.0
1999           >4              62     0.0

[1000 rows x 14 columns]
(1000, 14)
<class 'pandas.core.frame.DataFrame'>
      enrollee_id      city  city_development_index  gender  \
2000        26024  city_103                   0.920    Male
2001        20706   city_90                   0.698     NaN
2002         2905  city_103                   0.920    Male
2003        18076   city_16                   0.910    Male
2004        30287   city_21                   0.624    Male
...           ...       ...                     ...     ...
2995        23297  city_103                   0.920    Male
2996        24946   city_67                   0.855  Female
2997        31048  city_136                   0.897    Male
2998        20490  city_114                   0.926    Male
2999        28560   city_67                   0.855    Male

          relevent_experience enrolled_university education_level  \
2000  Has relevent experience       no_enrollment        Graduate
2001  Has relevent experience    Full time course             NaN
2002  Has relevent experience       no_enrollment        Graduate
2003  Has relevent experience       no_enrollment        Graduate
2004  Has relevent experience       no_enrollment        Graduate
...                       ...                 ...             ...
2995  Has relevent experience       no_enrollment     High School
2996  Has relevent experience    Full time course         Masters
2997  Has relevent experience    Part time course        Graduate
2998  Has relevent experience       no_enrollment     High School
2999  Has relevent experience    Full time course        Graduate

     major_discipline experience company_size    company_type last_new_job  \
2000             STEM         18      500-999         Pvt Ltd           >4
2001              NaN          4      100-500         Pvt Ltd            2
2002             STEM         13      100-500         Pvt Ltd            1
2003             STEM          5      100-500  Funded Startup            3
2004             STEM          7        50-99         Pvt Ltd            1
...               ...        ...          ...             ...          ...
2995              NaN        >20        10/49           Other            1
2996             STEM         16      100-500         Pvt Ltd            3
2997             STEM         10          <10         Pvt Ltd            1
2998              NaN          6    1000-4999         Pvt Ltd            3
2999             STEM         16        10/49             NaN            1

      training_hours  target
2000             164     0.0
2001              26     1.0
2002              29     0.0
2003              73     0.0
2004              12     1.0
...              ...     ...
2995             138     0.0
2996             168     0.0
2997              48     0.0
2998              15     1.0
2999              54     0.0

[1000 rows x 14 columns]
(1000, 14)
<class 'pandas.core.frame.DataFrame'>
      enrollee_id      city  city_development_index gender  \
3000        18980  city_136                   0.897   Male
3001        29039  city_103                   0.920   Male
3002        15786  city_103                   0.920   Male
3003        19439   city_21                   0.624    NaN
3004        21298  city_103                   0.920   Male
...           ...       ...                     ...    ...
3995         4212  city_160                   0.920   Male
3996        13469   city_16                   0.910   Male
3997        33187   city_16                   0.910   Male
3998         8601  city_160                   0.920  Other
3999        27511  city_103                   0.920    NaN

          relevent_experience enrolled_university education_level  \
3000  Has relevent experience       no_enrollment        Graduate
3001   No relevent experience       no_enrollment        Graduate
3002  Has relevent experience       no_enrollment        Graduate
3003   No relevent experience    Full time course             NaN
3004   No relevent experience    Full time course         Masters
...                       ...                 ...             ...
3995  Has relevent experience       no_enrollment        Graduate
3996  Has relevent experience    Part time course        Graduate
3997  Has relevent experience       no_enrollment        Graduate
3998   No relevent experience    Full time course        Graduate
3999  Has relevent experience       no_enrollment             Phd

     major_discipline experience company_size   company_type last_new_job  \
3000             STEM         12        50-99        Pvt Ltd            2
3001             STEM        >20       10000+        Pvt Ltd           >4
3002             STEM          4        50-99        Pvt Ltd            1
3003              NaN         <1          NaN            NaN            1
3004             STEM         14       10000+  Public Sector            2
...               ...        ...          ...            ...          ...
3995             STEM          8        50-99        Pvt Ltd           >4
3996             STEM         12    1000-4999        Pvt Ltd            1
3997       Humanities          5      500-999        Pvt Ltd           >4
3998             STEM          4          NaN            NaN            1
3999       Humanities        >20          NaN            NaN           >4

      training_hours  target
3000              59     0.0
3001              32     0.0
3002               9     0.0
3003              37     1.0
3004              52     1.0
...              ...     ...
3995              94     0.0
3996             167     0.0
3997              68     0.0
3998             114     1.0
3999             108     0.0

[1000 rows x 14 columns]
(1000, 14)
<class 'pandas.core.frame.DataFrame'>
      enrollee_id      city  city_development_index  gender  \
4000         9949   city_75                   0.939    Male
4001        28020   city_21                   0.624    Male
4002        22589  city_105                   0.794    Male
4003        16736  city_103                   0.920     NaN
4004        12145   city_57                   0.866     NaN
...           ...       ...                     ...     ...
4995         7892   city_21                   0.624  Female
4996        19768   city_21                   0.624    Male
4997        33180   city_16                   0.910    Male
4998        13215  city_103                   0.920  Female
4999         2386   city_21                   0.624    Male

          relevent_experience enrolled_university education_level  \
4000  Has relevent experience       no_enrollment        Graduate
4001   No relevent experience    Full time course        Graduate
4002  Has relevent experience       no_enrollment         Masters
4003   No relevent experience       no_enrollment         Masters
4004   No relevent experience       no_enrollment     High School
...                       ...                 ...             ...
4995  Has relevent experience       no_enrollment        Graduate
4996   No relevent experience       no_enrollment        Graduate
4997   No relevent experience       no_enrollment     High School
4998  Has relevent experience       no_enrollment        Graduate
4999  Has relevent experience       no_enrollment        Graduate

     major_discipline experience company_size         company_type  \
4000             STEM         15        50-99              Pvt Ltd
4001             STEM          2          NaN                  NaN
4002            Other         13          <10  Early Stage Startup
4003             STEM        NaN       10000+                  NaN
4004              NaN         <1          NaN                  NaN
...               ...        ...          ...                  ...
4995             STEM          3      100-500                  NaN
4996             STEM          3      100-500              Pvt Ltd
4997              NaN        >20    5000-9999              Pvt Ltd
4998             STEM         10       10000+              Pvt Ltd
4999             STEM          2    5000-9999              Pvt Ltd

     last_new_job  training_hours  target
4000           >4              35     0.0
4001        never              36     0.0
4002            1               6     0.0
4003          NaN             103     0.0
4004        never             182     0.0
...           ...             ...     ...
4995            1             114     1.0
4996            1              64     1.0
4997           >4              89     0.0
4998           >4              20     1.0
4999            2              16     0.0

[1000 rows x 14 columns]
(1000, 14)
<class 'pandas.core.frame.DataFrame'>
      enrollee_id      city  city_development_index  gender  \
5000        18582   city_83                   0.923    Male
5001        25222  city_159                   0.843     NaN
5002         5697   city_61                   0.913  Female
5003         5172   city_21                   0.624    Male
5004         1815   city_27                   0.848    Male
...           ...       ...                     ...     ...
5995        29855   city_91                   0.691    Male
5996        25271   city_21                   0.624    Male
5997         1721   city_21                   0.624    Male
5998         4421  city_103                   0.920    Male
5999        16792  city_114                   0.926    Male

          relevent_experience enrolled_university education_level  \
5000  Has relevent experience       no_enrollment         Masters
5001  Has relevent experience       no_enrollment        Graduate
5002  Has relevent experience       no_enrollment        Graduate
5003   No relevent experience    Full time course        Graduate
5004  Has relevent experience       no_enrollment         Masters
...                       ...                 ...             ...
5995   No relevent experience       no_enrollment        Graduate
5996  Has relevent experience       no_enrollment        Graduate
5997  Has relevent experience       no_enrollment        Graduate
5998  Has relevent experience       no_enrollment         Masters
5999  Has relevent experience       no_enrollment         Masters

     major_discipline experience company_size company_type last_new_job  \
5000             STEM          9       10000+      Pvt Ltd            4
5001             STEM          7          <10      Pvt Ltd            1
5002             STEM        >20      100-500          NaN            1
5003             STEM          3          NaN          NaN        never
5004             STEM         18       10000+      Pvt Ltd           >4
...               ...        ...          ...          ...          ...
5995             STEM         11          NaN          NaN            4
5996             STEM          3        50-99      Pvt Ltd            1
5997             STEM          3      500-999      Pvt Ltd            1
5998             STEM         11          <10          NGO            1
5999             STEM          5       10000+      Pvt Ltd            1

      training_hours  target
5000             170     0.0
5001             107     0.0
5002               9     0.0
5003              38     1.0
5004              17     1.0
...              ...     ...
5995               4     0.0
5996              21     0.0
5997              80     1.0
5998              28     0.0
5999              41     0.0

[1000 rows x 14 columns]
(1000, 14)
<class 'pandas.core.frame.DataFrame'>
      enrollee_id      city  city_development_index  gender  \
6000         3224   city_67                   0.855    Male
6001        21931   city_16                   0.910    Male
6002        23278   city_90                   0.698    Male
6003        22553   city_21                   0.624    Male
6004        25467  city_103                   0.920  Female
...           ...       ...                     ...     ...
6995        30451  city_103                   0.920     NaN
6996        26691  city_114                   0.926    Male
6997        28296  city_103                   0.920    Male
6998        11258   city_16                   0.910     NaN
6999        16137   city_21                   0.624    Male

          relevent_experience enrolled_university education_level  \
6000  Has relevent experience       no_enrollment        Graduate
6001  Has relevent experience       no_enrollment        Graduate
6002  Has relevent experience    Full time course         Masters
6003  Has relevent experience    Full time course        Graduate
6004   No relevent experience       no_enrollment         Masters
...                       ...                 ...             ...
6995  Has relevent experience       no_enrollment        Graduate
6996   No relevent experience       no_enrollment         Masters
6997   No relevent experience    Full time course        Graduate
6998   No relevent experience       no_enrollment        Graduate
6999   No relevent experience       no_enrollment         Masters

     major_discipline experience company_size    company_type last_new_job  \
6000             STEM          4        50-99   Public Sector            3
6001             STEM        >20        50-99  Funded Startup            1
6002             STEM         14          <10         Pvt Ltd            4
6003             STEM          5        50-99         Pvt Ltd            1
6004             STEM         10        50-99         Pvt Ltd            4
...               ...        ...          ...             ...          ...
6995             STEM          5          NaN             NaN            2
6996  Business Degree         <1          NaN             NaN            2
6997             STEM          4      500-999         Pvt Ltd            1
6998             STEM        >20          NaN             NaN            1
6999            Other         15          NaN   Public Sector            3

      training_hours  target
6000             158     0.0
6001              84     0.0
6002              28     0.0
6003             135     1.0
6004              56     0.0
...              ...     ...
6995             113     1.0
6996              34     1.0
6997              82     0.0
6998              45     0.0
6999              95     1.0

[1000 rows x 14 columns]
(1000, 14)
<class 'pandas.core.frame.DataFrame'>

Parsing the date format

In [36]:
pd.read_csv("IPL Matches 2008-2020.csv")

,id,city,date,player_of_match,venue,neutral_venue,team1,team2,toss_winner,toss_decision,winner,result,result_margin,eliminator,method,umpire1,umpire2
0,335982,Bangalore,2008-04-18,BB McCullum,M Chinnaswamy Stadium,0,Royal Challengers Bangalore,Kolkata Knight Riders,Royal Challengers Bangalore,field,Kolkata Knight Riders,runs,140.0,N,NaN,Asad Rauf,RE Koertzen
1,335983,Chandigarh,2008-04-19,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",0,Kings XI Punjab,Chennai Super Kings,Chennai Super Kings,bat,Chennai Super Kings,runs,33.0,N,NaN,MR Benson,SL Shastri
2,335984,Delhi,2008-04-19,MF Maharoof,Feroz Shah Kotla,0,Delhi Daredevils,Rajasthan Royals,Rajasthan Royals,bat,Delhi Daredevils,wickets,9.0,N,NaN,Aleem Dar,GA Pratapkumar
3,335985,Mumbai,2008-04-20,MV Boucher,Wankhede Stadium,0,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,Royal Challengers Bangalore,wickets,5.0,N,NaN,SJ Davis,DJ Harper
4,335986,Kolkata,2008-04-20,DJ Hussey,Eden Gardens,0,Kolkata Knight Riders,Deccan Chargers,Deccan Chargers,bat,Kolkata Knight Riders,wickets,5.0,N,NaN,BF Bowden,K Hariharan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
811,1216547,Dubai,2020-09-28,AB de Villiers,Dubai International Cricket Stadium,0,Royal Challengers Bangalore,Mumbai Indians,Mumbai Indians,field,Royal Challengers Bangalore,tie,NaN,Y,NaN,Nitin Menon,PR Reiffel
812,1237177,Dubai,2020-11-05,JJ Bumrah,Dubai International Cricket Stadium,0,Mumbai Indians,Delhi Capitals,Delhi Capitals,field,Mumbai Indians,runs,57.0,N,NaN,CB Gaffaney,Nitin Menon
813,1237178,Abu Dhabi,2020-11-06,KS Williamson,Sheikh Zayed Stadium,0,Royal Challengers Bangalore,Sunrisers Hyderabad,Sunrisers Hyderabad,field,Sunrisers Hyderabad,wickets,6.0,N,NaN,PR Reiffel,S Ravi
814,1237180,Abu Dhabi,2020-11-08,MP Stoinis,Sheikh Zayed Stadium,0,Delhi Capitals,Sunrisers Hyderabad,Delhi Capitals,bat,Delhi Capitals,runs,17.0,N,NaN,PR Reiffel,S Ravi
815,1237181,Dubai,2020-11-10,TA Boult,Dubai International Cricket Stadium,0,Delhi Capitals,Mumbai Indians,Delhi Capitals,bat,Mumbai Indians,wickets,5.0,N,NaN,CB Gaffaney,Nitin Menon

In [37]:
pd.read_csv("IPL Matches 2008-2020.csv" ).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               816 non-null    int64
 1   city             803 non-null    object
 2   date             816 non-null    object
 3   player_of_match  812 non-null    object
 4   venue            816 non-null    object
 5   neutral_venue    816 non-null    int64
 6   team1            816 non-null    object
 7   team2            816 non-null    object
 8   toss_winner      816 non-null    object
 9   toss_decision    816 non-null    object
 10  winner           812 non-null    object
 11  result           812 non-null    object
 12  result_margin    799 non-null    float64
 13  eliminator       812 non-null    object
 14  method           19 non-null     object
 15  umpire1          816 non-null    object
 16  umpire2          816 non-null    object
dtypes: float64(1), int64(2), object(14)
memory usage: 108.5+ KB

In [35]:
pd.read_csv("IPL Matches 2008-2020.csv" , parse_dates = [ 'date' ]).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               816 non-null    int64
 1   city             803 non-null    object
 2   date             816 non-null    datetime64[ns]
 3   player_of_match  812 non-null    object
 4   venue            816 non-null    object
 5   neutral_venue    816 non-null    int64
 6   team1            816 non-null    object
 7   team2            816 non-null    object
 8   toss_winner      816 non-null    object
 9   toss_decision    816 non-null    object
 10  winner           812 non-null    object
 11  result           812 non-null    object
 12  result_margin    799 non-null    float64
 13  eliminator       812 non-null    object
 14  method           19 non-null     object
 15  umpire1          816 non-null    object
 16  umpire2          816 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(2), object(13)
memory usage: 108.5+ KB

In [38]:
# As u can see above the format has changed to date format and we can perform special operations on it .

Handling data of different encoding values

In [ ]:
#       As we know the data is mostly of utf-8  encoding but sometimes we may get parsing errors while loading data,
#  to handle that we will use the encoding method to check for specific encoding.

pd.read_csv("zomato.csv")

UnicodeDecodeError: 'utf-8' codec can't decode byte 0xed in position 7044: invalid continuation byte

In [48]:
pd.read_csv("zomato.csv" , encoding = 'latin-1')

,Restaurant ID,Restaurant Name,Country Code,City,Address,Locality,Locality Verbose,Longitude,Latitude,Cuisines,...,Currency,Has Table booking,Has Online delivery,Is delivering now,Switch to order menu,Price range,Aggregate rating,Rating color,Rating text,Votes
0,6317637,Le Petit Souffle,162,Makati City,"Third Floor, Century City Mall, Kalayaan Avenu...","Century City Mall, Poblacion, Makati City","Century City Mall, Poblacion, Makati City, Mak...",121.027535,14.565443,"French, Japanese, Desserts",...,Botswana Pula(P),Yes,No,No,No,3,4.8,Dark Green,Excellent,314
1,6304287,Izakaya Kikufuji,162,Makati City,"Little Tokyo, 2277 Chino Roces Avenue, Legaspi...","Little Tokyo, Legaspi Village, Makati City","Little Tokyo, Legaspi Village, Makati City, Ma...",121.014101,14.553708,Japanese,...,Botswana Pula(P),Yes,No,No,No,3,4.5,Dark Green,Excellent,591
2,6300002,Heat - Edsa Shangri-La,162,Mandaluyong City,"Edsa Shangri-La, 1 Garden Way, Ortigas, Mandal...","Edsa Shangri-La, Ortigas, Mandaluyong City","Edsa Shangri-La, Ortigas, Mandaluyong City, Ma...",121.056831,14.581404,"Seafood, Asian, Filipino, Indian",...,Botswana Pula(P),Yes,No,No,No,4,4.4,Green,Very Good,270
3,6318506,Ooma,162,Mandaluyong City,"Third Floor, Mega Fashion Hall, SM Megamall, O...","SM Megamall, Ortigas, Mandaluyong City","SM Megamall, Ortigas, Mandaluyong City, Mandal...",121.056475,14.585318,"Japanese, Sushi",...,Botswana Pula(P),No,No,No,No,4,4.9,Dark Green,Excellent,365
4,6314302,Sambo Kojin,162,Mandaluyong City,"Third Floor, Mega Atrium, SM Megamall, Ortigas...","SM Megamall, Ortigas, Mandaluyong City","SM Megamall, Ortigas, Mandaluyong City, Mandal...",121.057508,14.584450,"Japanese, Korean",...,Botswana Pula(P),Yes,No,No,No,4,4.8,Dark Green,Excellent,229
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9546,5915730,NamlÛ± Gurme,208,ÛÁstanbul,"Kemankeô Karamustafa Paôa Mahallesi, RÛ±htÛ±...",Karakí_y,"Karakí_y, ÛÁstanbul",28.977392,41.022793,Turkish,...,Turkish Lira(TL),No,No,No,No,3,4.1,Green,Very Good,788
9547,5908749,Ceviz AÛôacÛ±,208,ÛÁstanbul,"Koôuyolu Mahallesi, Muhittin íìstí_ndaÛô Cadd...",Koôuyolu,"Koôuyolu, ÛÁstanbul",29.041297,41.009847,"World Cuisine, Patisserie, Cafe",...,Turkish Lira(TL),No,No,No,No,3,4.2,Green,Very Good,1034
9548,5915807,Huqqa,208,ÛÁstanbul,"Kuruí_eôme Mahallesi, Muallim Naci Caddesi, N...",Kuruí_eôme,"Kuruí_eôme, ÛÁstanbul",29.034640,41.055817,"Italian, World Cuisine",...,Turkish Lira(TL),No,No,No,No,4,3.7,Yellow,Good,661
9549,5916112,Aôôk Kahve,208,ÛÁstanbul,"Kuruí_eôme Mahallesi, Muallim Naci Caddesi, N...",Kuruí_eôme,"Kuruí_eôme, ÛÁstanbul",29.036019,41.057979,Restaurant Cafe,...,Turkish Lira(TL),No,No,No,No,4,4.0,Green,Very Good,901
9550,5927402,Walter's Coffee Roastery,208,ÛÁstanbul,"CafeaÛôa Mahallesi, BademaltÛ± Sokak, No 21/B,...",Moda,"Moda, ÛÁstanbul",29.026016,40.984776,Cafe,...,Turkish Lira(TL),No,No,No,No,2,4.0,Green,Very Good,591

In [49]:
# Also we have another paramter error_bad_lines = False to remove the rows with extra values to be removed and fetch the other rows in order>

Importing data via json file

In [50]:
# The read_json is used here and some of the parameters are same as read_csv

In [51]:
pd.read_json("train.json")

          id      cuisine                                        ingredients
0      10259        greek  [romaine lettuce, black olives, grape tomatoes...
1      25693  southern_us  [plain flour, ground pepper, salt, tomatoes, g...
2      20130     filipino  [eggs, pepper, salt, mayonaise, cooking oil, g...
3      22213       indian                [water, vegetable oil, wheat, salt]
4      13162       indian  [black pepper, shallots, cornflour, cayenne pe...
...      ...          ...                                                ...
39769  29109        irish  [light brown sugar, granulated sugar, butter, ...
39770  11462      italian  [KRAFT Zesty Italian Dressing, purple onion, b...
39771   2238        irish  [eggs, citrus fruit, raisins, sourdough starte...
39772  41882      chinese  [boneless chicken skinless thigh, minced garli...
39773   2362      mexican  [green chile, jalapeno chilies, onions, ground...

[39774 rows x 3 columns]

In [52]:
# via a link :
pd.read_json("https://api.exchangerate-api.com/v4/latest/INR")

,provider,WARNING_UPGRADE_TO_V6,terms,base,date,time_last_updated,rates
INR,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-12-16,1765843201,1.0000
AED,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-12-16,1765843201,0.0404
AFN,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-12-16,1765843201,0.7290
ALL,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-12-16,1765843201,0.9060
AMD,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-12-16,1765843201,4.2100
...,...,...,...,...,...,...,...
YER,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-12-16,1765843201,2.6300
ZAR,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-12-16,1765843201,0.1850
ZMW,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-12-16,1765843201,0.2550
ZWG,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-12-16,1765843201,0.2880
ZWL,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,INR,2025-12-16,1765843201,0.2880

In [53]:
# To work with sql we need a xampp server to host which I will host later...